## Terraform Plan Results

✅ Plan succeeded

<details>
<summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.firestore.google_firebaserules_release.firestore must be replaced
-/+ resource "google_firebaserules_release" "firestore" {
      ~ create_time  = "2025-11-30T08:08:31.555655Z" -> (known after apply)
      ~ disabled     = false -> (known after apply)
      ~ id           = "projects/wedding-smile-catcher/releases/cloud.firestore" -> (known after apply)
        name         = "cloud.firestore"
      ~ ruleset_name = "projects/wedding-smile-catcher/rulesets/248a5df9-cec4-457f-8414-88ecea767f8a" -> "3c5b7fab-3ffc-4b00-89cf-e9342bca35d9" # forces replacement
      ~ update_time  = "2025-12-07T02:07:30.637345Z" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.functions.data.archive_file.scoring_source will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "scoring_source" {
      + excludes            = [
          + "*.pyc",
          + ".DS_Store",
          + ".env",
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "./../src/functions/scoring"
      + type                = "zip"
    }

  # module.functions.data.archive_file.webhook_source will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "webhook_source" {
      + excludes            = [
          + "*.pyc",
          + ".DS_Store",
          + ".env",
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "./../src/functions/webhook"
      + type                = "zip"
    }

  # module.functions.google_cloudfunctions2_function.scoring will be updated in-place
  ~ resource "google_cloudfunctions2_function" "scoring" {
        id               = "projects/wedding-smile-catcher/locations/asia-northeast1/functions/scoring"
        name             = "scoring"
        # (10 unchanged attributes hidden)

      ~ build_config {
            # (6 unchanged attributes hidden)

          ~ source {
              ~ storage_source {
                  ~ object     = "functions/scoring-f34ca5ae3bb02050f8baf7c900d9e5c0.zip" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

      ~ service_config {
          ~ environment_variables            = {
              - "CURRENT_EVENT_ID" = "test" -> null
                # (3 unchanged elements hidden)
            }
            # (11 unchanged attributes hidden)

          ~ secret_environment_variables {
              ~ project_id = "548587922270" -> "wedding-smile-catcher"
                # (3 unchanged attributes hidden)
            }
        }
    }

  # module.functions.google_cloudfunctions2_function.webhook will be updated in-place
  ~ resource "google_cloudfunctions2_function" "webhook" {
        id               = "projects/wedding-smile-catcher/locations/asia-northeast1/functions/webhook"
        name             = "webhook"
        # (10 unchanged attributes hidden)

      ~ build_config {
            # (6 unchanged attributes hidden)

          ~ source {
              ~ storage_source {
                  ~ object     = "functions/webhook-abfa000a7b9db08be7ee2c4b02dedbb2.zip" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.functions.google_storage_bucket_object.scoring_source must be replaced
-/+ resource "google_storage_bucket_object" "scoring_source" {
      + content          = (sensitive value)
      ~ content_type     = "application/zip" -> (known after apply)
      ~ crc32c           = "FgUl9g==" -> (known after apply)
      ~ detect_md5hash   = "80ylrjuwIFD4uvfJANnlwA==" -> "different hash"
      - event_based_hold = false -> null
      ~ generation       = 1764490111624913 -> (known after apply)
      ~ id               = "wedding-smile-images-wedding-smile-catcher-functions/scoring-f34ca5ae3bb02050f8baf7c900d9e5c0.zip" -> (known after apply)
      + kms_key_name     = (known after apply)
      ~ md5hash          = "80ylrjuwIFD4uvfJANnlwA==" -> (known after apply)
      ~ md5hexhash       = "f34ca5ae3bb02050f8baf7c900d9e5c0" -> (known after apply)
      ~ media_link       = "https://storage.googleapis.com/download/storage/v1/b/wedding-smile-images-wedding-smile-catcher/o/functions%2Fscoring-f34ca5ae3bb02050f8baf7c900d9e5c0.zip?generation=1764490111624913&alt=media" -> (known after apply)
      - metadata         = {} -> null
      ~ name             = "functions/scoring-f34ca5ae3bb02050f8baf7c900d9e5c0.zip" # forces replacement -> (known after apply) # forces replacement
      ~ output_name      = "functions/scoring-f34ca5ae3bb02050f8baf7c900d9e5c0.zip" -> (known after apply)
      ~ self_link        = "https://www.googleapis.com/storage/v1/b/wedding-smile-images-wedding-smile-catcher/o/functions%2Fscoring-f34ca5ae3bb02050f8baf7c900d9e5c0.zip" -> (known after apply)
      ~ source           = "./.terraform/tmp/scoring-20251130080830.zip" # forces replacement -> (known after apply) # forces replacement
      ~ storage_class    = "STANDARD" -> (known after apply)
      - temporary_hold   = false -> null
        # (1 unchanged attribute hidden)
    }

  # module.functions.google_storage_bucket_object.webhook_source must be replaced
-/+ resource "google_storage_bucket_object" "webhook_source" {
      + content          = (sensitive value)
      ~ content_type     = "application/zip" -> (known after apply)
      ~ crc32c           = "XMumbw==" -> (known after apply)
      ~ detect_md5hash   = "q/oACnudsIvn7ixLAt7bsg==" -> "different hash"
      - event_based_hold = false -> null
      ~ generation       = 1764490111870009 -> (known after apply)
      ~ id               = "wedding-smile-images-wedding-smile-catcher-functions/webhook-abfa000a7b9db08be7ee2c4b02dedbb2.zip" -> (known after apply)
      + kms_key_name     = (known after apply)
      ~ md5hash          = "q/oACnudsIvn7ixLAt7bsg==" -> (known after apply)
      ~ md5hexhash       = "abfa000a7b9db08be7ee2c4b02dedbb2" -> (known after apply)
      ~ media_link       = "https://storage.googleapis.com/download/storage/v1/b/wedding-smile-images-wedding-smile-catcher/o/functions%2Fwebhook-abfa000a7b9db08be7ee2c4b02dedbb2.zip?generation=1764490111870009&alt=media" -> (known after apply)
      - metadata         = {} -> null
      ~ name             = "functions/webhook-abfa000a7b9db08be7ee2c4b02dedbb2.zip" # forces replacement -> (known after apply) # forces replacement
      ~ output_name      = "functions/webhook-abfa000a7b9db08be7ee2c4b02dedbb2.zip" -> (known after apply)
      ~ self_link        = "https://www.googleapis.com/storage/v1/b/wedding-smile-images-wedding-smile-catcher/o/functions%2Fwebhook-abfa000a7b9db08be7ee2c4b02dedbb2.zip" -> (known after apply)
      ~ source           = "./.terraform/tmp/webhook-20251130080830.zip" # forces replacement -> (known after apply) # forces replacement
      ~ storage_class    = "STANDARD" -> (known after apply)
      - temporary_hold   = false -> null
        # (1 unchanged attribute hidden)
    }

Plan: 3 to add, 2 to change, 3 to destroy.
```

</details>

**Pusher**: @nakayamaryo0731
**Action**: pull_request
